#1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:*  - Для N = 5: 1, -3, 9, -27, 81
# n = (int(input('введите число: ')))
# i = 0
# while n > i:
#     print((-3)**i)
#     i=i+1

#2. Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
#*Пример:*   Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
# n = (int(input('введите число: ')))
# i = 1
# while n >= i:
#     print(f'{i}:{(3*i+1)}')
#     i=i+1

# n = int(input())
# some_dict = {}
# for i in range(1, n + 1):
#     some_dict[i] = 3 * i + 1
# print(some_dict)


#3.Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой
# a=input('введите исходную строку ')
# b=input('введите искомое число ')
# for i in 
# if b in a:
#      print(a[a.index(b)])
# else: 
#      print('нет')





